results/stages-test.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 40ms over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 095/100 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 095/100 VUs  40ms


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<341' p(95)=231.62ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 95      89.86362/s
    checks_succeeded...: 100.00% 95 out of 95
    checks_failed......: 0.00%   0 out of 95

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=141ms min=51.65ms  med=141.89ms max=243.51ms p(90)=229.27ms p(95)=231.62ms
      { expected_response:true }...: avg=141ms min=51.65ms  med=141.89ms max=243.51ms p(90)=229.27ms p(95)=231.62ms
    http_req_failed................: 0.00%  0 out of 190
    http_reqs......................: 190    179.727241/s

    EXECUTION
    iteration_duration.............: avg=1.01s min=983.95ms med=1.01s    max=1.04s    p(90)=1.02s    p(95)=1.03s   
    iterations.....................: 95     89.86362/s
    vus............................: 95     min=95       max=95 
    vus_max........................: 100    min=100      max=100

    NETWORK
    data_received..................: 1.3 MB 1.2 MB/s
    data_sent......................: 338 kB 320 kB/s



running (01.1s), 000/100 VUs, 95 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  40ms